backend/app/services/activity_service.rb

INSERT INTO "activities" ("action", "created_at", "details", "lead_id", "updated_at", "user_id") VALUES ('lead_created', '2026-07-26 05:08:11.855604', 'Lead was created', 1, '2026-07-26 05:08:11.855604', 2) RETURNING "id"
---
  def self.track(lead:, user: nil, action:, details: nil)
    Activity.create!(
      lead: lead,
      user: user,
      action: action,
      details: details
    )