backend/app/controllers/application_controller.rb

  def authenticate_request
    header = request.headers["Authorization"]
    token = header&.split(" ")&.last
    decoded = JwtService.decode(token)

    if decoded
      @current_user = User.find_by(id: decoded[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1