backend/app/controllers/api/auth_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = 'admin@example.com' LIMIT 1
---
    def login
      user = User.find_by(email: params[:email])