backend/app/controllers/api/leads_controller.rb

SELECT "users".* FROM "users" ORDER BY "users"."created_at" DESC
---
    def index
      leads = policy_scope(Lead)
      leads = leads.search(params[:search])
      leads = leads.by_status(params[:status])
      leads = leads.by_assigned_user(params[:assigned_to_id])
      leads = leads.newest_first

      paginated = leads.page(params[:page] || 1).per(params[:per_page] || 10)

SELECT "activities".* FROM "activities" WHERE "activities"."lead_id" = 1 ORDER BY "activities"."created_at" DESC
SELECT "notes".* FROM "notes" WHERE "notes"."lead_id" = 1 ORDER BY "notes"."created_at" DESC
SELECT "users".* FROM "users" WHERE "users"."id" IN (1, 2)
---
    def show
      authorize @lead
      render json: {
        lead: LeadSerializer.new(@lead).as_json,
        notes: @lead.notes.newest_first.includes(:user).map { |note| NoteSerializer.new(note).as_json },
        activities: @lead.activities.newest_first.includes(:user).map { |activity| ActivitySerializer.new(activity).as_json }

INSERT INTO "leads" ("assigned_to_id", "company", "created_at", "email", "message", "name", "phone", "status", "updated_at") VALUES (NULL, 'TestCo', '2026-07-26 17:18:28.626403', 'test@example.com', 'Test message', 'Test User', '+1-555-9999', 0, '2026-07-26 17:18:28.626403') RETURNING "id"
---
    def create
      @lead = Lead.new(lead_params)
      @lead.status = :new_lead

      if @lead.save

UPDATE "leads" SET "status" = 1, "updated_at" = '2026-07-26 17:33:45.527836' WHERE "leads"."id" = 9
---
    def update_status
      authorize @lead, :update_status?

      old_status = @lead.status
      new_status = params[:status]

      if @lead.update(status: new_status)

SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1
UPDATE "leads" SET "assigned_to_id" = 2, "updated_at" = '2026-07-26 17:35:31.465326' WHERE "leads"."id" = 5
---
    def assign
      authorize @lead, :assign?

      assigned_user = User.find_by(id: params[:assigned_to_id])

      if assigned_user.nil?
        return render json: { error: "User not found" }, status: :not_found
      end

      @lead.update!(assigned_to: assigned_user)

INSERT INTO "notes" ("created_at", "lead_id", "message", "updated_at", "user_id") VALUES ('2026-07-26 17:18:30.914187', 1, 'This is a test note', '2026-07-26 17:18:30.914187', 1) RETURNING "id"
---
    def add_note
      authorize @lead, :add_note?

      note = @lead.notes.build(
        message: params[:message],
        user: current_user
      )

      if note.save

SELECT "leads".* FROM "leads" WHERE "leads"."id" = 1 LIMIT 1
---
    def set_lead
      @lead = Lead.find(params[:id])