backend/app/controllers/api/leads_controller.rb

SELECT "activities".* FROM "activities" WHERE "activities"."lead_id" = $1 ORDER BY "activities"."created_at" DESC  [["lead_id", 65]]
SELECT "notes".* FROM "notes" WHERE "notes"."lead_id" = $1 ORDER BY "notes"."created_at" DESC  [["lead_id", 65]]
---
    def show
      authorize @lead
      render json: {
        lead: LeadSerializer.new(@lead).as_json,
        notes: @lead.notes.newest_first.includes(:user).map { |note| NoteSerializer.new(note).as_json },
        activities: @lead.activities.newest_first.includes(:user).map { |activity| ActivitySerializer.new(activity).as_json }

INSERT INTO "leads" ("assigned_to_id", "company", "created_at", "email", "message", "name", "phone", "status", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
    def create
      @lead = Lead.new(lead_params)
      @lead.status = :new_lead

      if @lead.save

UPDATE "leads" SET "name" = $1, "updated_at" = $2 WHERE "leads"."id" = $3  [["name", "Updated Name"], ["updated_at", "2026-07-26 18:03:20.377654"], ["id", 71]]
---
    def update
      authorize @lead

      if @lead.update(lead_params)

DELETE FROM "leads" WHERE "leads"."id" = $1  [["id", 73]]
---
    def destroy
      authorize @lead
      @lead.destroy

UPDATE "leads" SET "status" = $1, "updated_at" = $2 WHERE "leads"."id" = $3  [["status", 1], ["updated_at", "2026-07-26 18:03:20.478071"], ["id", 75]]
---
    def update_status
      authorize @lead, :update_status?

      old_status = @lead.status
      new_status = params[:status]

      if @lead.update(status: new_status)

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 88], ["LIMIT", 1]]
---
    def assign
      authorize @lead, :assign?

      assigned_user = User.find_by(id: params[:assigned_to_id])

INSERT INTO "notes" ("created_at", "lead_id", "message", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2026-07-26 18:03:20.564096"], ["lead_id", 79], ["message", "Test note"], ["updated_at", "2026-07-26 18:03:20.564096"], ["user_id", 92]]
---
    def add_note
      authorize @lead, :add_note?

      note = @lead.notes.build(
        message: params[:message],
        user: current_user
      )

      if note.save

SELECT "leads".* FROM "leads" WHERE "leads"."id" = $1 LIMIT $2  [["id", 79], ["LIMIT", 1]]
---
    def set_lead
      @lead = Lead.find(params[:id])