backend/app/controllers/api/users_controller.rb

SELECT "users".* FROM "users" ORDER BY "users"."created_at" DESC
---
    def index
      users = User.all.order(created_at: :desc)

INSERT INTO "users" ("created_at", "email", "name", "password_digest", "role", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["created_at", "2026-07-26 18:03:20.653851"], ["email", "[FILTERED]"], ["name", "New User"], ["password_digest", "[FILTERED]"], ["role", 0], ["updated_at", "2026-07-26 18:03:20.653851"]]
---
    def create
      user = User.new(user_params)

      if user.save