backend/app/controllers/api/users_controller.rb

SELECT "users".* FROM "users" ORDER BY "users"."created_at" DESC
---
    def index
      users = User.all.order(created_at: :desc)
      render json: { data: users.map { |user| UserSerializer.new(user).as_json } }, status: :ok