backend/app/serializers/lead_serializer.rb

SELECT COUNT(*) FROM "activities" WHERE "activities"."lead_id" = 1
SELECT COUNT(*) FROM "notes" WHERE "notes"."lead_id" = 1
---
  def as_json(options = {})
    {
      id: @lead.id,
      name: @lead.name,
      email: @lead.email,
      phone: @lead.phone,
      company: @lead.company,
      message: @lead.message,
      status: @lead.status,
      status_label: @lead.status&.humanize,
      assigned_to: assigned_user,
      created_at: @lead.created_at,
      updated_at: @lead.updated_at,
      notes_count: @lead.notes.count,
      activities_count: @lead.activities.count